[
	{
		"id":0,
		"thum":"img",
		"name": "paladin",
		"expand":false,
		"classFeatures":{
			"blurb":"Paladins serve as beacons for their allies within the chaos of battle. While deadly opponents of evil, they can also empower goodly souls to aid in their crusades. Their magic and martial skills also make them well suited to defending others and blessing the fallen with the strength to continue fighting.",
			"alignment":"lawful good",
			"hd": 10,
			"wealth":{
				"number":5,
				"type":6
			},
			"skills":2,
			"classSkills":[
				"craft", 
				"diplomacy",
				"handleAnimal",
				"heal", 
				"knowledge (nobility)",
				"knowledge (religion)",
				"profession",
				"ride",
				"senseMotive",
				"spellcraft"
			],
			"bab":"full",
			"goodSaves":["fortitude", "will"],
			"proficiency":[ "simple weapons", "martial weapons", "light armor", "medium armor", "heavy armor", "shields" ],
			"table":[
				["level", "bab", "fort", "ref", "will", "special", "spells"],
				["1", "1", "2", "0", "2", [{"name":"aura of good", "type":"Ex", "description":["The power of a paladin’s aura of good (see the detect good spell) is equal to her paladin level."], "expand":true}, {"name":"detect evil", "type":"Sp", "description":["At will, a paladin can use detect evil, as the spell. A paladin can, as a move action, concentrate on a single item or individual within 60 feet and determine if it is evil, learning the strength of its aura as if having studied it for 3 rounds. While focusing on one individual or object, the paladin does not detect evil in any other object or individual within range."], "expand":true},{"name":"smite evil", "type":"Su", "description":["Once per day, a paladin can call out to the powers of good to aid her in her struggle against evil. As a swift action, the paladin chooses one target within sight to smite. If this target is evil, the paladin adds her Cha bonus (if any) to her attack rolls and adds her paladin level to all damage rolls made against the target of her smite. If the target of smite evil is an outsider with the evil subtype, an evil-aligned dragon, or an undead creature, the bonus to damage on the first successful attack increases to 2 points of damage per level the paladin possesses. Regardless of the target, smite evil attacks automatically bypass any DR the creature might possess.", "In addition, while smite evil is in effect, the paladin gains a deflection bonus equal to her Charisma modifier (if any) to her AC against attacks made by the target of the smite. If the paladin targets a creature that is not evil, the smite is wasted with no effect.", "The smite evil effect remains until the target of the smite is dead or the next time the paladin rests and regains her uses of this ability. At 4th level, and at every three levels thereafter, the paladin may smite evil one additional time per day to a maximum of seven times per day at 19th level."], "expand":true}]],
				["2", "1", "1", "0", "1", [{"name":"divine grace", "type":"Su", "description":["At 2nd level, a paladin gains a bonus equal to her Charisma bonus (if any) on all Saving Throws."], "expand":true}, {"name":"lay on hands", "type":"Su", "description":["Beginning at 2nd level, a paladin can heal wounds (her own or those of others) by touch. Each day she can use this ability a number of times equal to 1/2 her paladin level plus her Charisma modifier. With one use of this ability, a paladin can heal 1d6 hit points of damage for every two paladin levels she possesses. Using this ability is a standard action, unless the paladin targets herself, in which case it is a swift action. Despite the name of this ability, a paladin only needs one free hand to use this ability.", "Alternatively, a paladin can use this healing power to deal damage to undead creatures, dealing 1d6 points of damage for every two levels the paladin possesses. Using lay on hands in this way requires a successful melee touch attack and doesn’t provoke an attack of opportunity. Undead do not receive a saving throw against this damage."], "expand":true}]],
				["3", "1", "0", "1", "0", [{"name":"aura of courage", "type":"Su", "description":["At 3rd level, a paladin is immune to fear (magical or otherwise). Each ally within 10 feet of her gains a +4 morale bonus on saving throws against fear effects. This ability functions only while the paladin is conscious, not if she is unconscious or dead."], "expand":true}, {"name":"divine health", "type":"Ex", "description":["At 3rd level, a paladin is immune to all diseases, including supernatural and magical diseases, including mummy rot."], "expand":true}, {"name":"mercy", "type":"Su", "description":["At 3rd level, and every three levels thereafter, a paladin can select one mercy. Each mercy adds an effect to the paladin’s lay on hands ability. Whenever the paladin uses lay on hands to heal damage to one target, the target also receives the additional effects from all of the mercies possessed by the paladin. A mercy can remove a condition caused by a curse, disease, or poison without curing the affliction. Such conditions return after 1 hour unless the mercy actually removes the affliction that causes the condition.", "These abilities are cumulative. For example, a 12th-level paladin’s lay on hands ability heals 6d6 points of damage and might also cure Fatigued and Exhausted conditions as well as removing diseases and neutralizing poisons. Once a condition or spell effect is chosen, it can’t be changed."], "expand":true}]],
				["4", "1", "1", "0", "1", [{"name":"channel positive energy", "type":"Su", "description":["When a paladin reaches 4th level, she gains the supernatural ability to channel positive energy like a cleric. Using this ability consumes two uses of her lay on hands ability. A paladin uses her level as her effective cleric level when channeling positive energy. This is a Charisma-based ability."], "expand":true},{"name":"smite evil", "type":"Su", "description":"2/day", "expand":true},{"name":"spells", "description":["Beginning at 4th level, a paladin gains the ability to cast a small number of divine spells which are drawn from the paladin spell list. A paladin must choose and prepare her spells in advance. To prepare or cast a spell, a paladin must have a Charisma score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a paladin’s spell is 10 + the spell level + the paladin’s Charisma modifier.", "Like other spellcasters, a paladin can cast only a certain number of spells of each spell level per day. In addition, she receives bonus spells per day if she has a high Charisma score. A paladin must spend 1 hour each day in quiet prayer and meditation to regain her daily allotment of spells. A paladin may prepare and cast any spell on the paladin spell list, provided that she can cast spells of that level, but she must choose which spells to prepare during her daily meditation.", "Through 3rd level, a paladin has no caster level. At 4th level and higher, her caster level is equal to her paladin level – 3."], "expand":true}], {"1":0}],
				["5", "1", "0", "0", "0", [{"name":"divine bond", "type":"Sp", "description":["Upon reaching 5th level, a paladin forms a divine bond with her god. This bond can take one of two forms. Once the form is chosen, it cannot be changed.", "The first type of bond allows the paladin to enhance her weapon as a standard action by calling upon the aid of a celestial spirit for 1 minute per paladin level. When called, the spirit causes the weapon to shed light as a torch. At 5th level, this spirit grants the weapon a +1 enhancement bonus. For every three levels beyond 5th, the weapon gains another +1 enhancement bonus, to a maximum of +6 at 20th level. These bonuses can be added to the weapon, stacking with existing weapon bonuses to a maximum of +5, or they can be used to add any of the following weapon properties: axiomatic, brilliant energy, defending, disruption, flaming, flaming burst, holy, keen, merciful, and speed. Adding these properties consumes an amount of bonus equal to the property’s cost. These bonuses are added to any properties the weapon already has, but duplicate abilities do not stack. If the weapon is not magical, at least a +1 enhancement bonus must be added before any other properties can be added. The bonus and properties granted by the spirit are determined when the spirit is called and cannot be changed until the spirit is called again. The celestial spirit imparts no bonuses if the weapon is held by anyone other than the paladin but resumes giving bonuses if returned to the paladin. These bonuses apply to only one end of a double weapon. A paladin can use this ability once per day at 5th level, and one additional time per day for every four levels beyond 5th, to a total of four times per day at 17th level.", "If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.", "The second type of bond allows a paladin to gain the service of an unusually intelligent, strong, and loyal steed to serve her in her crusade against evil. This mount is usually a heavy horse (for a Medium paladin) or a pony (for a Small paladin), although more exotic mounts, such as a boar, camel, or dog are also suitable. This mount functions as a druid’s animal companion, using the paladin’s level as her effective druid level. Bonded mounts have an Intelligence of at least 6.", "Once per day, as a full-round action, a paladin may magically call her mount to her side. This ability is the equivalent of a spell of a level equal to one-third the paladin’s level. The mount immediately appears adjacent to the paladin. A paladin can use this ability once per day at 5th level, and one additional time per day for every 4 levels thereafter, for a total of four times per day at 17th level.", "At 11th level, the mount gains the celestial creature simple template and becomes a magical beast for the purposes of determining which spells affect it.", "At 15th level, a paladin’s mount gains spell resistance equal to the paladin’s level + 11.", "Should the paladin’s mount die, the paladin may not summon another mount for 30 days or until she gains a paladin level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls."], "expand":true}], {"1":1}],
				["6", "1", "1", "1", "1", [{"name":"mercy", "type":"Su", "description":"", "expand":true}], {"1":1}],
				["7", "1", "0", "0", "0", [{"name":"smite evil", "type":"Su", "description":"3/day", "expand":true}], {"1":1, "2":0}],
				["8", "1", "1", "0", "1", [{"name":"arua of resolve", "type":"Su", "description":["At 8th level, a paladin is immune to charm spells and spell-like abilities. Each ally within 10 feet of her gains a +4 morale bonus on saving throws against charm effects. This ability functions only while the paladin is conscious, not if she is unconscious or dead."], "expand":true}], {"1":1, "2":1}],
				["9", "1", "0", "1", "0", [{"name":"mercy", "type":"Su", "description":"", "expand":true}], {"1":2, "2":1}],
				["10", "1", "1", "0", "1", [{"name":"smite evil", "type":"Su", "description":"4/day", "expand":true}], {"1":2, "2":1, "3":0}],
				["11", "1", "0", "0", "0", [{"name":"aura of justice", "type":"Su", "description":["At 11th level, a paladin can expend two uses of her smite evil ability to grant the ability to smite evil to all allies within 10 feet, using her bonuses. Allies must use this smite evil ability by the start of the paladin’s next turn and the bonuses last for 1 minute. Using this ability is a free action. Evil creatures gain no benefit from this ability."], "expand":true}], {"1":2, "2":1, "3":1}],
				["12", "1", "1", "1", "1", [{"name":"mercy", "type":"Su", "description":"", "expand":true}], {"1":2, "2":2, "3":1}],
				["13", "1", "0", "0", "0", [{"name":"smite evil", "type":"Su", "description":"5/day", "expand":true}], {"1":3, "2":2, "3":1, "4":0}],
				["14", "1", "1", "0", "1", [{"name":"aura of faith", "type":"Su", "description":["At 14th level, a paladin’s weapons are treated as good-aligned for the purposes of overcoming Damage Reduction. Any attack made against an enemy within 10 feet of her is treated as good-aligned for the purposes of overcoming Damage Reduction. This ability functions only while the paladin is conscious, not if she is unconscious or dead."], "expand":true}], {"1":3, "2":2, "3":1, "4":1}],
				["15", "1", "0", "1", "0", [{"name":"mercy", "type":"Su", "description":"", "expand":true}], {"1":3, "2":2, "3":2, "4":1}],
				["16", "1", "1", "0", "1", [{"name":"smite evil", "type":"Su", "description":"6/day", "expand":true}], {"1":3, "2":3, "3":2, "4":1}],
				["17", "1", "0", "0", "0", [{"name":"aura of righteousness", "type":"Su", "description":["At 17th level, a paladin gains DR 5/evil and immunity to compulsion spells and spell-like abilities. Each ally within 10 feet of her gains a +4 morale bonus on saving throws against compulsion effects. This ability functions only while the paladin is conscious, not if she is unconscious or dead."], "expand":true}], {"1":4, "2":3, "3":2, "4":1}],
				["18", "1", "1", "1", "1", [{"name":"mercy", "type":"Su", "description":"", "expand":true}], {"1":4, "2":3, "3":2, "4":2}],
				["19", "1", "0", "0", "0", [{"name":"smite evil", "type":"Su", "description":"7/day", "expand":true}], {"1":4, "2":3, "3":3, "4":2}],
				["20", "1", "1", "0", "1", [{"name":"holy champion", "type":"Su", "description":["At 20th level, a paladin becomes a conduit for the power of her god. Her DR increases to 10/evil. Whenever she uses smite evil and successfully strikes an evil outsider, the outsider is also subject to a banishment, using her paladin level as the caster level (her weapon and holy symbol automatically count as objects that the subject hates). After the banishment effect and the damage from the attack is resolved, the smite immediately ends. In addition, whenever she channels positive energy or uses lay on hands to heal a creature, she heals the maximum possible amount."], "expand":true}], {"1":4, "2":4, "3":3, "4":3}]
			]
		}
	},
	{
		"id":1,
		"thum":"img",
		"name": "ranger",
		"expand":false,
		"classFeatures":{
			"blurb":"Ranger are deft skirmishers, either in melee or at range, capable of skillfully dancing in and out of battle. Their abilities allow them to deal significant harm to specific types of foes, but their skills are valuable against all manner of enemies.",
			"alignment":"any",
			"hd": 10,
			"wealth":{
				"number":5,
				"type":6
			},
			"skills":6,
			"classSkills":[
				"climb",
				"craft",
				"handleAnimal",
				"heal",
				"intimidate",
				"knowledge (dungeoneering)",
				"knowledge (geography)",
				"knowledge (nature)",
				"perception",
				"profession",
				"ride",
				"spellcraft",
				"stealth",
				"survival",
				"swim"
			],
			"bab":"full",
			"goodSaves":["fortitude", "reflex"],
			"proficiency":[ "simple weapons", "martial weapons", "light armor", "medium armor", "shields" ],
			"table":[
				["level", "bab", "fort", "ref", "will", "special", "spells"],
				["1", "1", "2", "0", "2", [{"name":"favored enemy", "type":"Ex", "description":["At 1st level, a ranger selects a creature type from the ranger favored enemies table. He gains a +2 bonus on Bluff, Knowledge, Perception, Sense Motive, and Survival checks against creatures of his selected type. Likewise, he gets a +2 bonus on weapon attack and damage rolls against them. A ranger may make Knowledge skill checks untrained when attempting to identify these creatures.", "At 5th level and every five levels thereafter (10th, 15th, and 20th level), the ranger may select an additional favored enemy. In addition, at each such interval, the bonus against any one favored enemy (including the one just selected, if so desired) increases by +2.", "If the ranger chooses humanoids or outsiders as a favored enemy, he must also choose an associated subtype, as indicated on the table below. (Note that there are other types of humanoid to choose from—those called out specifically on the table below are merely the most common.) If a specific creature falls into more than one category of favored enemy, the ranger’s bonuses do not stack; he simply uses whichever bonus is higher."]}, {"name":"track", "type":"Ex", "description":["A ranger adds half his level (minimum 1) to Survival skill checks made to follow tracks."]}, {"name":"wild empathy", "type":"Ex", "description":["A ranger can improve the initial attitude of an animal. This ability functions just like a Diplomacy check to improve the attitude of a person (see Using Skills). The ranger rolls 1d20 and adds his ranger level and his Charisma bonus to determine the wild empathy check result. The typical domestic animal has a starting attitude of indifferent, while wild animals are usually unfriendly.", "To use wild empathy, the ranger and the animal must be within 30 feet of one another under normal visibility conditions. Generally, influencing an animal in this way takes 1 minute, but, as with influencing people, it might take more or less time.", "The ranger can also use this ability to influence a magical beast with an Intelligence score of 1 or 2, but he takes a –4 penalty on the check."]}]],
				["2", "1", "1", "0", "1", [{"name":"combat style feat", "type":"Ex", "description":["At 2nd level, a ranger must select one combat style to pursue. The ranger’s expertise manifests in the form of bonus feats at 2nd, 6th, 10th, 14th, and 18th level. He can choose feats from his selected combat style, even if he does not have the normal prerequisites.", "The benefits of the ranger’s chosen style feats apply only when he wears light, medium, or no armor. He loses all benefits of his combat style feats when wearing heavy armor. Once a ranger selects a combat style, it cannot be changed."]}]],
				["3", "1", "0", "1", "0", [{"name":"endurance", "description":["A ranger gains Endurance as a bonus feat at 3rd level."]}, {"name":"favored terrain", "type":"Ex", "description":["At 3rd level, a ranger may select a type of terrain from Table: Ranger Favored Terrains. The ranger gains a +2 bonus on initiative checks and Knowledge (geography), Perception, Stealth, and Survival skill checks when he is in this terrain. A ranger traveling through his favored terrain normally leaves no trail and cannot be tracked (though he may leave a trail if he so chooses).", "At 8th level and every five levels thereafter, the ranger may select an additional favored terrain. In addition, at each such interval, the skill bonus and initiative bonus in any one favored terrain (including the one just selected, if so desired), increases by +2.", "If a specific terrain falls into more than one category of favored terrain, the ranger’s bonuses do not stack; he simply uses whichever bonus is higher."]}]],
				["4", "1", "1", "0", "1", [{"name":"hunters bond", "type":"Ex", "description":["At 4th level, a ranger forms a bond with his hunting companions. This bond can take one of two forms. Once the form is chosen, it cannot be changed. The first is a bond to his companions. This bond allows him to spend a move action to grant half his favored enemy bonus against a single target of the appropriate type to all allies within 30 feet who can see or hear him. This bonus lasts for a number of rounds equal to the ranger’s Wisdom modifier (minimum 1). This bonus does not stack with any favored enemy bonuses possessed by his allies; they use whichever bonus is higher.", "The second option is to form a close bond with an animal companion. A ranger who selects an animal companion can choose from the following list: badger, bird, camel, cat (small), dire rat, dog, horse, pony, snake (viper or constrictor), or wolf. If the campaign takes place wholly or partly in an aquatic environment, the ranger may choose a shark instead. This animal is a loyal companion that accompanies the ranger on his adventures as appropriate for its kind. A ranger’s animal companion shares his favored enemy and favored terrain bonuses.", "This ability functions like the druid animal companion ability (which is part of the Nature Bond class feature), except that the ranger’s effective druid level is equal to his ranger level –3."]}, {"name":"spells", "description":["Beginning at 4th level, a ranger gains the ability to cast a small number of divine spells, which are drawn from the ranger spell list. A ranger must choose and prepare his spells in advance. To prepare or cast a spell, a ranger must have a Wisdom score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a ranger’s spell is 10 + the spell level + the ranger’s Wisdom modifier.", "Like other spellcasters, a ranger can cast only a certain number of spells of each spell level per day. His base daily spell allotment is given on Table: Ranger. In addition, he receives bonus spells per day if he has a high Wisdom score (see Table: Ability Modifiers and Bonus Spells). When Table: Ranger indicates that the ranger gets 0 spells per day of a given spell level, he gains only the bonus spells he would be entitled to based on his Wisdom score for that spell level.", "A ranger must spend 1 hour per day in quiet meditation to regain his daily allotment of spells. A ranger may prepare and cast any spell on the ranger spell list, provided that he can cast spells of that level, but he must choose which spells to prepare during his daily meditation.", "Through 3rd level, a ranger has no caster level. At 4th level and higher, his caster level is equal to his ranger level – 3."]}], {"1":0}],
				["5", "1", "0", "0", "0", [{"name":"favored enemy", "type":"Ex", "description":["2nd"]}], {"1":1}],
				["6", "1", "1", "1", "1", [{"name":"combat style feat", "description":[]}], {"1":1}],
				["7", "1", "0", "0", "0", [{"name":"woodland stride", "type":"Ex", "description":["Starting at 7th level, a ranger may move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at his normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that are enchanted or magically manipulated to impede motion, however, still affect him."]}], {"1":1, "2":0}],
				["8", "1", "1", "0", "1", [{"name":"swift tracker", "type":"Ex", "description":["Beginning at 8th level, a ranger can move at his normal speed while using Survival to follow tracks without taking the normal –5 penalty. He takes only a –10 penalty (instead of the normal –20) when moving at up to twice normal speed while tracking."]}, {"name":"favored terrain", "type":"Ex", "description":["2nd"]}], {"1":1, "2":1}],
				["9", "1", "0", "1", "0", [{"name":"evasion", "type":"Ex", "description":["When he reaches 9th level, a ranger can avoid even magical and unusual attacks with great agility. If he makes a successful Reflex saving throw against an attack that normally deals half damage on a successful save, he instead takes no damage. Evasion can be used only if the ranger is wearing light armor, medium armor, or no armor. A helpless ranger does not gain the benefit of evasion."]}], {"1":2, "2":1}],
				["10", "1", "1", "0", "1", [{"name":"favored enemy", "type":"Ex", "description":["2nd"]}, {"name":"combat style feat", "description":[]}], {"1":2, "2":1, "3":0}],
				["11", "1", "0", "0", "0", [{"name":"quarry", "type":"Ex", "description":["At 11th level, a ranger can, as a standard action, denote one target within his line of sight as his quarry. Whenever he is following the tracks of his quarry, a ranger can take 10 on his Survival skill checks while moving at normal speed, without penalty. In addition, he receives a +2 insight bonus on attack rolls made against his quarry, and all critical threats are automatically confirmed. A ranger can have no more than one quarry at a time and the creature’s type must correspond to one of his favored enemy types. He can dismiss this effect at any time as a free action, but he cannot select a new quarry for 24 hours. If the ranger sees proof that his quarry is dead, he can select a new quarry after waiting 1 hour."]}], {"1":2, "2":1, "3":1}],
				["12", "1", "1", "1", "1", [{"name":"camouflage", "type":"Ex", "description":["A ranger of 12th level or higher can use the Stealth skill to hide in any of his favored terrains, even if the terrain doesn’t grant cover or concealment."]}], {"1":2, "2":2, "3":1}],
				["13", "1", "0", "0", "0", [{"name":"favored terrain", "type":"Ex", "description":["3rd"]}], {"1":3, "2":2, "3":1, "4":0}],
				["14", "1", "1", "0", "1", [{"name":"combat style feat", "description":[]}], {"1":3, "2":2, "3":1, "4":1}],
				["15", "1", "0", "1", "0", [{"name":"favored enemy", "type":"Ex", "description":["4th"]}], {"1":3, "2":2, "3":2, "4":1}],
				["16", "1", "1", "0", "1", [{"name":"improved evasion", "type":"Ex", "description":["At 16th level, a ranger’s evasion improves. This ability works like evasion, except that while the ranger still takes no damage on a successful Reflex saving throw against attacks, he henceforth takes only half damage on a failed save. A helpless ranger does not gain the benefit of improved evasion."]}], {"1":3, "2":3, "3":2, "4":1}],
				["17", "1", "0", "0", "0", [{"name":"hide in plain sight", "type":"Ex", "description":["While in any of his favored terrains, a ranger of 17th level or higher can use the Stealth skill even while being observed."]}], {"1":4, "2":3, "3":2, "4":1}],
				["18", "1", "1", "1", "1", [{"name":"favored terrain", "type":"Ex", "description":["4th"]}, {"name":"combat style feat","description":[]}], {"1":4, "2":3, "3":2, "4":2}],
				["19", "1", "0", "0", "0", [{"name":"improved quarry", "type":"Ex", "description":["At 19th level, the ranger’s ability to hunt his quarry improves. He can now select a quarry as a free action, and can now take 20 while using Survival to track his quarry, while moving at normal speed without penalty. His insight bonus to attack his quarry increases to +4. If his quarry is killed or dismissed, he can select a new one after 10 minutes have passed."]}], {"1":4, "2":3, "3":3, "4":2}],
				["20", "1", "1", "0", "1", [{"name":"master hunter", "type":"Ex", "description":["A ranger of 20th level becomes a master hunter. He can always move at full speed while using Survival to follow tracks without penalty. He can, as a standard action, make a single attack against a favored enemy at his full attack bonus. If the attack hits, the target takes damage normally and must make a Fortitude save or die. The DC of this save is equal to 10 + 1/2 the ranger’s level + the ranger’s Wisdom modifier. A ranger can choose instead to deal an amount of nonlethal damage equal to the creature’s current hit points. A successful save negates this damage. A ranger can use this ability once per day against each favored enemy type he possesses, but not against the same creature more than once in a 24-hour period."]}, {"name":"favored enemy", "type":"Ex", "description":["5th"]}], {"1":4, "2":4, "3":3, "4":3}]
			]
		}
	},
	{
		"id":2,
		"thum":"img",
		"name": "cleric",
		"expand":false,
		"classFeatures":{
			"blurb":"More than capable of upholding the honor of their deities in battle, clerics often prove stalwart and capable combatants. Their true strength lies in their capability to draw upon the power of their deities, whether to increase their own and their allies’ prowess in battle, to vex their foes with divine magic, or to lend healing to companions in need. As their powers are influenced by their faith, all clerics must focus their worship upon a divine source. While the vast majority of clerics revere a specific deity, a small number dedicate themselves to a divine concept worthy of devotion—such as battle, death, justice, or knowledge—free of a deific abstraction.",
			"alignment":"any",
			"hd": 8,
			"wealth":{
				"number":4,
				"type":6
			},
			"skills":2,
			"classSkills":[
				"appraise",
				"craft",
				"diplomacy",
				"heal",
				"knowledge (arcana)",
				"knowledge (history)",
				"knowledge (nobility)",
				"knowledge (planes)",
				"knowledge (religion)",
				"linguistics",
				"profession",
				"senseMotive",
				"spellcraft"
			],
			"bab":"3/4",
			"goodSaves":["fortitude", "will"],
			"proficiency":[ "favored weapon of their deities", "simple weapons", "light armor", "medium armor", "shields" ],
			"table":[
				["level", "bab", "fort", "ref", "will", "special", "spells"],
				["1", "0", "2", "2", "0", [{"name":"aura", "type":"Ex", "description":["A cleric of a chaotic, evil, good, or lawful deity has a particularly powerful aura corresponding to the deity’s alignment."]}, {"name":"spells", "description":["A cleric casts divine spells which are drawn from the cleric spell list. Her alignment, however, may restrict her from casting certain spells opposed to her moral or ethical beliefs. A cleric can’t cast spells of an alignment opposed to her own or her deity’s (if she has one). Spells associated with particular alignments are indicated by the chaotic, evil, good, and lawful descriptors in their spell descriptions. A cleric must choose and prepare her spells in advance.", "To prepare or cast a spell, a cleric must have a Wisdom score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a cleric’s spell is 10 + the spell level + the cleric’s Wisdom modifier.", "Like other spellcasters, a cleric can cast only a certain number of spells of each spell level per day. Her base daily spell allotment is given on Table: Cleric. In addition, she receives bonus spells per day if she has a high Wisdom score.", "Clerics meditate or pray for their spells. Each cleric must choose a time at which she must spend 1 hour each day in quiet contemplation or supplication to regain her daily allotment of spells. Time spent resting has no effect on whether a cleric can prepare spells. A cleric may prepare and cast any spell on the cleric spell list, provided that she can cast spells of that level, but she must choose which spells to prepare during her daily meditation."]}, {"name":"orisons", "description":["Clerics can prepare a number of orisons, or 0-level spells, each day. These spells are treated like any other spell, but they are not expended when cast and may be used again."]}, {"name":"channel energy", "type":"Su", "description":["Regardless of alignment, any cleric can release a wave of energy by channeling the power of her faith through her holy (or unholy) symbol. This energy can be used to cause or heal damage, depending on the type of energy channeled and the creatures targeted. A cleric must be able to present her holy symbol to use this ability.", "A good cleric (or a neutral cleric who worships a good deity) channels positive energy and can choose to deal damage to undead creatures or to heal living creatures. An evil cleric (or a neutral cleric who worships an evil deity) channels negative energy and can choose to deal damage to living creatures or to heal undead creatures. A neutral cleric of a neutral deity (or one who is not devoted to a particular deity) must choose whether she channels positive or negative energy. Once this choice is made, it cannot be reversed. This decision also determines whether the cleric can cast spontaneous cure or inflict spells (see spontaneous casting).", "Channeling energy causes a burst that affects all creatures of one type (either undead or living) in a 30-foot radius centered on the cleric. The amount of damage dealt or healed is equal to 1d6 points of damage plus 1d6 points of damage for every two cleric levels beyond 1st (2d6 at 3rd, 3d6 at 5th, and so on). Creatures that take damage from channeled energy receive a Will save to halve the damage. The DC of this save is equal to 10 + 1/2 the cleric’s level + the cleric’s Charisma modifier. Creatures healed by channel energy cannot exceed their maximum hit point total—all excess healing is lost. A cleric may channel energy a number of times per day equal to 3 + her Charisma modifier. This is a standard action that does not provoke an attack of opportunity. A cleric can choose whether or not to include herself in this effect."]}, {"name":"domains", "description":["A cleric’s deity influences her alignment, what magic she can perform, her values, and how others see her. A cleric chooses two domains from among those belonging to her deity. A cleric can select an alignment domain (Chaos, Evil, Good, or Law) only if her alignment matches that domain. If a cleric is not devoted to a particular deity, she still selects two domains to represent her spiritual inclinations and abilities (subject to GM approval). The restriction on alignment domains still applies.", "Each domain grants a number of domain powers, dependent upon the level of the cleric, as well as a number of bonus spells. A cleric gains one domain spell slot for each level of cleric spell she can cast, from 1st on up. Each day, a cleric can prepare one of the spells from her two domains in that slot. If a domain spell is not on the cleric spell list, a cleric can prepare it only in her domain spell slot. Domain spells cannot be used to cast spells spontaneously. In addition, a cleric gains the listed powers from both of her domains, if she is of a high enough level. Unless otherwise noted, activating a domain power is a standard action."]}, {"name":"spontaneous casting", "description":["A good cleric (or a neutral cleric of a good deity) can channel stored spell energy into healing spells that she did not prepare ahead of time. The cleric can “lose” any prepared spell that is not an orison or domain spell in order to cast any cure spell of the same spell level or lower (a cure spell is any spell with “cure” in its name).", "An evil cleric (or a neutral cleric of an evil deity) can’t convert prepared spells to cure spells but can convert them to inflict spells (an inflict spell is one with “inflict” in its name).", "A cleric who is neither good nor evil and whose deity is neither good nor evil can convert spells to either cure spells or inflict spells (player’s choice). Once the player makes this choice, it cannot be reversed. This choice also determines whether the cleric channels positive or negative energy (see channel energy)."]}, {"name":"bonus languages", "description":["A cleric’s bonus language options include Celestial, Abyssal, and Infernal (the languages of good, chaotic evil, and lawful evil outsiders, respectively). These choices are in addition to the bonus languages available to the character because of her race."]}], {"0":3, "1":1}],
				["2", "1", "1", "1", "0", [], {"0":4, "1":2}],
				["3", "1", "0", "0", "1", [{"name":"channel energy", "type":"Su", "description":["2nd"]}], {"0":4, "1":2, "2":1}],
				["4", "1", "1", "1", "0", [], {"0":4, "1":3, "2":2}],
				["5", "0", "0", "0", "0", [{"name":"channel energy", "type":"Su", "description":["3rd"]}], {"0":4, "1":3, "2":2, "3":1}],
				["6", "1", "1", "1", "1", [], {"0":4, "1":3, "2":3, "3":2}],
				["7", "1", "0", "0", "0", [{"name":"channel energy", "type":"Su", "description":["4th"]}], {"0":4, "1":4, "2":3, "3":2, "4":1}],
				["8", "1", "1", "1", "0", [], {"0":4, "1":4, "2":3, "3":3, "4":2}],
				["9", "0", "0", "0", "1", [{"name":"channel energy", "type":"Su", "description":["5th"]}], {"0":4, "1":4, "2":4, "3":3, "4":2, "5":1}],
				["10", "1", "1", "1", "0", [], {"0":4, "1":4, "2":4, "3":3, "4":3, "5":2}],
				["11", "1", "0", "0", "0", [{"name":"channel energy", "type":"Su", "description":["6th"]}], {"0":4, "1":4, "2":4, "3":4, "4":3, "5":2, "6":1}],
				["12", "1", "1", "1", "1", [], {"0":4, "1":4, "2":4, "3":4, "4":3, "5":3, "6":2}],
				["13", "0", "0", "0", "0", [{"name":"channel energy", "type":"Su", "description":["7th"]}], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":3, "6":2, "7":1}],
				["14", "1", "1", "1", "0", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":3, "6":3, "7":2}],
				["15", "1", "0", "0", "1", [{"name":"channel energy", "type":"Su", "description":["8th"]}], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":3, "7":2, "8":1}],
				["16", "1", "1", "1", "0", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":3, "7":3, "8":2}],
				["17", "0", "0", "0", "0", [{"name":"channel energy", "type":"Su", "description":["9th"]}], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":4, "7":3, "8":2, "9":1}],
				["18", "1", "1", "1", "1", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":4, "7":3, "8":3, "9":2}],
				["19", "1", "0", "0", "0", [{"name":"channel energy", "type":"Su", "description":["10th"]}], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":4, "7":4, "8":3, "9":3}],
				["20", "1", "1", "1", "0", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":4, "7":4, "8":4, "9":4}]
			]
		}
	},
 	{
		"id":3,
		"thum":"img",
		"name": "bard",
		"expand":false,
		"classFeatures":{
			"blurb":"Bards capably confuse and confound their foes while inspiring their allies to ever-greater daring. While accomplished with both weapons and magic, the true strength of bards lies outside melee, where they can support their companions and undermine their foes without fear of interruptions to their performances.",
			"alignment":"any",
			"hd": 8,
			"wealth":{
				"number":3,
				"type":6
			},
			"skills":6,
			"classSkills":[
				"acrobatics",
				"appraise",
				"bluff",
				"climb",
				"craft",
				"diplomacy",
				"disguise",
				"escapeArtist",
				"intimidate",
				"knowledge (arcana)",
				"knowledge (dungeoneering)",
				"knowledge (engineering)",
				"knowledge (geography)",
				"knowledge (history)",
				"knowledge (local)",
				"knowledge (nature)",
				"knowledge (nobility)",
				"knowledge (planes)",
				"knowledge (religion)",
				"linguistics",
				"perception",
				"perform",
				"profession",
				"senseMotive",
				"sleightOfHand",
				"spellcraft",
				"stealth",
				"useMagicDevice"
			],
			"bab":"full",
			"goodSaves":["fortitude", "reflex"],
			"proficiency":[ "simple weapons", "longsword","rapier", "sap", "shortsword", "shortbow", "whip", "light armor", "shields" ],
			"table":[
				["level", "bab", "fort", "ref", "will", "special", "spells"],
				["1", "0", "0", "2", "2", [{"name":"bardic knowledge", "type":"Ex", "description":["A bard adds half his class level (minimum 1) to all Knowledge skill checks and may make all Knowledge skill checks untrained."]}, {"name":"bardic performance", "description":["A bard is trained to use the Perform skill to create magical effects on those around him, including himself if desired. He can use this ability for a number of rounds per day equal to 4 + his Charisma modifier. At each level after 1st a bard can use bardic performance for 2 additional rounds per day. Each round, the bard can produce any one of the types of bardic performance that he has mastered, as indicated by his level.", "Starting a bardic performance is a standard action, but it can be maintained each round as a free action. Changing a bardic performance from one effect to another requires the bard to stop the previous performance and start a new one as a standard action. A bardic performance cannot be disrupted, but it ends immediately if the bard is killed, paralyzed, stunned, knocked unconscious, or otherwise prevented from taking a free action to maintain it each round. A bard cannot have more than one bardic performance in effect at one time.", "At 7th level, a bard can start a bardic performance as a move action instead of a standard action. At 13th level, a bard can start a bardic performance as a swift action.", "Each bardic performance has audible components, visual components, or both. If a bardic performance has audible components, the targets must be able to hear the bard for the performance to have any effect, and many such performances are language dependent (as noted in the description). A deaf bard has a 20% chance to fail when attempting to use a bardic performance with an audible component. If he fails this check, the attempt still counts against his daily limit. Deaf creatures are immune to bardic performances with audible components. If a bardic performance has a visual component, the targets must have line of sight to the bard for the performance to have any effect. A blind bard has a 50% chance to fail when attempting to use a bardic performance with a visual component. If he fails this check, the attempt still counts against his daily limit. Blind creatures are immune to bardic performances with visual components."]}, {"name":"countersong", "type":"Su", "description":["At 1st level, a bard learns to counter magic effects that depend on sound (but not spells that have verbal components.) Each round of the countersong he makes a Perform (keyboard, percussion, wind, string, or sing) skill check. Any creature within 30 feet of the bard (including the bard himself) that is affected by a sonic or language-dependent magical attack may use the bard’s Perform check result in place of its saving throw if, after the saving throw is rolled, the Perform check result proves to be higher. If a creature within range of the countersong is already under the effect of a non-instantaneous sonic or language-dependent magical attack, it gains another saving throw against the effect each round it hears the countersong, but it must use the bard’s Perform skill check result for the save. Countersong does not work on effects that don’t allow saves. Countersong relies on audible components."]}, {"name":"distraction", "type":"Su", "description":["At 1st level, a bard can use his performance to counter magic effects that depend on sight. Each round of the Distraction, he makes a Perform (act, comedy, dance, or oratory) skill check. Any creature within 30 feet of the bard (including the bard himself) that is affected by an illusion (pattern) or illusion (figment) magical attack may use the bard’s Perform check result in place of its saving throw if, after the saving throw is rolled, the Perform check result proves to be higher. If a creature within range of the Distraction is already under the effect of a non-instantaneous illusion (pattern) or illusion (figment) magical attack, it gains another saving throw against the effect each round it sees the Distraction, but it must use the bard’s Perform check result for the save. Distraction does not work on effects that don’t allow saves. Distraction relies on visual components."]},		{"name":"fascinate", "type":"Su", "description":["At 1st level, a bard can use his performance to cause one or more creatures to become fascinated with him. Each creature to be fascinated must be within 90 feet, able to see and hear the bard, and capable of paying attention to him. The bard must also be able to see the creatures affected. The Distraction of a nearby combat or other dangers prevents the ability from working. For every three levels a bard has attained beyond 1st, he can target one additional creature with this ability.", "Each creature within range receives a Will save (DC 10 + 1/2 the bard’s level + the bard’s Cha modifier) to negate the effect. If a creature’s saving throw succeeds, the bard cannot attempt to fascinate that creature again for 24 hours. If its saving throw fails, the creature sits quietly and observes the performance for as long as the bard continues to maintain it. While fascinated, a target takes a –4 penalty on skill checks made as reactions, such as Perception checks. Any potential threat to the target allows the target to make a new saving throw against the effect. Any obvious threat, such as someone drawing a weapon, casting a spell, or aiming a weapon at the target, automatically breaks the effect.", "Fascinate is an enchantment (compulsion), mind-affecting ability. Fascinate relies on audible and visual components in order to function."]},{"name":"inspire courage", "type":"Su", "description":["A 1st level bard can use his performance to inspire courage in his allies (including himself), bolstering them against fear and improving their combat abilities. To be affected, an ally must be able to perceive the bard’s performance. An affected ally receives a +1 morale bonus on saving throws against charm and fear effects and a +1 competence bonus on attack and weapon damage rolls. At 5th level, and every six bard levels thereafter, this bonus increases by +1, to a maximum of +4 at 17th level. Inspire courage is a mind-affecting ability. inspire courage can use audible or visual components. The bard must choose which component to use when starting his performance."]},{"name":"cantrips", "type":"Sp", "description":["Bard’s learn a number of cantrips, or 0-level spells. These spells are cast like any other spell, but they do not consume any slots and may be used again."]},{"name":"spells", "description":["A bard casts arcane spells drawn from the bard spell list. He can cast any spell he knows without preparing it ahead of time. Every bard spell has a verbal component (singing, reciting, or music). To learn or cast a spell, a bard must have a Charisma score equal to at least 10 + the spell level. The Difficulty Class (DC) for a saving throw against a bard’s spell is 10 + the spell level + the bard’s Charisma modifier.", "Like other spellcasters, a bard can cast only a certain number of spells of each spell level per day. In addition, he receives bonus spells per day if he has a high Charisma score.", "The bard’s selection of spells is extremely limited. A bard begins play knowing four 0-level spells and two 1st-level spells of the bard’s choice. At each new bard level, he gains one or more new spells, as indicated on Table: Bard Spells Known. (Unlike spells per day, the number of spells a bard knows is not affected by his Charisma score.", "Upon reaching 5th level, and at every third bard level after that (8th, 11th, and so on), a bard can choose to learn a new spell in place of one he already knows. In effect, the bard “loses” the old spell in exchange for the new one. The new spell’s level must be the same as that of the spell being exchanged, and it must be at least one level lower than the highest-level bard spell the bard can cast. A bard may swap only a single spell at any given level, and must choose whether or not to swap the spell at the same time that he gains new spells known for the level.", "A bard need not prepare his spells in advance. He can cast any spell he knows at any time, assuming he has not yet used up his allotment of spells per day for the spell’s level."]}], {"1":1}, {"0":4, "1":2}],
				["2", "1", "0", "1", "1", [{"name":"versatile performance", "type":"Ex", "description":["At 2nd level, a bard can choose one type of Perform skill. He can use his bonus in that skill in place of his bonus in associated skills. When substituting in this way, the bard uses his total Perform skill bonus, including class skill bonus, in place of its associated skill’s bonus, whether or not he has ranks in that skill or if it is a class skill. At 6th level, and every 4 levels thereafter, the bard can select an additional type of Perform to substitute.", "The types of Perform and their associated skills are: Act (Bluff, Disguise), Comedy (Bluff, Intimidate), Dance (Acrobatics, Fly), Keyboard Instruments (Diplomacy, Intimidate), Oratory (Diplomacy, Sense Motive), Percussion (Handle Animal, Intimidate), Sing (Bluff, Sense Motive), String (Bluff, Diplomacy), and Wind (Diplomacy, Handle Animal)."]}, {"name":"well-versed", "type":"Ex", "description":["At 2nd level, the bard becomes resistant to the bardic performance of others, and to sonic effects in general. The bard gains a +4 bonus on saving throws made against bardic performance, sonic, and language-dependent effects."]}], {"1":2}, {"0":5, "1":3}],
				["3", "1", "1", "0", "0", [{"name":"inspire competence", "type":"Su", "description":["Inspire Competence (Su): A bard of 3rd level or higher can use his performance to help an ally succeed at a task. The ally must be within 30 feet and able to see and hear the bard. The ally gets a +2 competence bonus on skill checks with a particular skill as long as she continues to hear the bard’s performance. This bonus increases by +1 for every four levels the bard has attained beyond 3rd (+3 at 7th, +4 at 11th, +5 at 15th, and +6 at 19th).", "Certain uses of this ability are infeasible, such as Stealth, and may be disallowed at the GM’s discretion. A bard can’t inspire competence in himself. inspire competence relies on audible components."]}], {"1":3}, {"0":6, "1":4}],
				["4", "1", "0", "1", "1", [], {"1":3, "2":1}, {"0":6, "1":4, "2":2}],
				["5", "0", "0", "0", "0", [{"name":"lore master", "type":"Ex", "description":["At 5th level, the bard becomes a master of lore and can take 10 on any Knowledge skill check that he has ranks in. A bard can choose not to take 10 and can instead roll normally. In addition, once per day, the bard can take 20 on any Knowledge skill check as a standard action. He can use this ability one additional time per day for every six levels he possesses beyond 5th, to a maximum of three times per day at 17th level."]}], {"1":4, "2":2}, {"0":6, "1":4, "2":3}],
				["6", "1", "1", "1", "1", [{"name":"suggestion", "type":"Sp", "description":["A bard of 6th level or higher can use his performance to make a suggestion (as per the spell) to a creature that he has already fascinated (see above). Using this ability does not disrupt the fascinate effect, but it does require a standard action to activate (in addition to the free action to continue the fascinate effect). A bard can use this ability more than once against an individual creature during an individual performance.", "A Will saving throw (DC 10 + 1/2 bard’s level + bard’s Cha modifier) negates the effect. This ability affects only a single creature (but see mass suggestion, below). Suggestion is an enchantment (compulsion), mind-affecting, language-dependent ability and relies on audible components."]}, {"name":"versatile performance", "type":"Ex", "description":["2nd"]}], {"1":4, "2":3}, {"0":6, "1":4, "2":4}],
				["7", "1", "0", "0", "0", [], {"1":4, "2":3, "3":1}, {"0":6, "1":5, "2":4, "3":2}],
				["8", "1", "0", "1", "1", [{"name":"dirge of doom", "type":"Su", "description":["A bard of 8th level or higher can use his performance to foster a sense of growing dread in his enemies, causing them to take become shaken. To be affected, an enemy must be within 30 feet and able to see and hear the bard’s performance. The effect persists for as long as the enemy is within 30 feet and the bard continues the performance. The performance cannot cause a creature to become frightened or panicked, even if the targets are already shaken from another effect. Dirge of doom is a mind-affecting fear effect, and it relies on audible and visual components."]}], {"1":4, "2":4, "3":2}, {"0":6, "1":5, "2":4, "3":3}],
				["9", "0", "1", "0", "0", [{"name":"inspire greatness", "type":"Su", "description":["A bard of 9th level or higher can use his performance to inspire greatness in himself or a single willing ally within 30 feet, granting extra fighting capability. For every three levels a bard attains beyond 9th, he can target one additional ally while using this performance (up to a maximum of four at 18th level). To inspire greatness, all of the targets must be able to see and hear the bard. A creature inspired with greatness gains 2 bonus Hit Dice (d10s), the commensurate number of temporary hit points (apply the target’s Constitution modifier, if any, to these bonus Hit Dice), a +2 competence bonus on attack rolls, and a +1 competence bonus on Fortitude saves. The bonus Hit Dice count as regular Hit Dice for determining the effect of spells that are Hit Dice dependent. Inspire greatness is a mind-affecting ability and it relies on audible and visual components."]}], {"1":5, "2":4, "3":3}, {"0":6, "1":5, "2":4, "3":4}],
				["10", "1", "0", "1", "1", [{"name":"jack of all trades", "type":"Ex", "description":["At 10th level, the bard can use any skill, even if the skill normally requires him to be trained."]}, {"name":"versatile performance", "type":"Ex", "description":["3rd"]}], {"1":5, "2":4, "3":3, "4":1}, {"0":6, "1":5, "2":5, "3":4, "4":2}],
				["11", "1", "0", "0", "0", [], {"1":5, "2":4, "3":4, "4":2}, {"0":6, "1":6, "2":5, "3":4, "4":3}],
				["12", "1", "1", "1", "1", [{"name":"soothing performance", "type":"Su", "description":["A bard of 12th level or higher can use his performance to create an effect equivalent to the mass cure serious wounds, using the bard’s level as the caster level. In addition, this performance removes the fatigued, sickened, and shaken condition from all those affected. Using this ability requires 4 continuous performance, and the targets must be able to see and hear the bard throughout the performance. Soothing performance relies on audible and visual components."]}], {"1":5, "2":5, "3":4, "4":3}, {"0":6, "1":6, "2":5, "3":4, "4":4}],
				["13", "0", "0", "0", "0", [], {"1":5, "2":5, "3":4, "4":3, "5":1}, {"0":6, "1":6, "2":5, "3":5, "4":4, "5":2}],
				["14", "1", "0", "1", "1", [{"name":"frightening tune", "type":"Sp", "description":["A bard of 14th level or higher can use his performance to cause fear in his enemies. To be affected, an enemy must be able to hear the bard perform and be within 30 feet. Each enemy within range receives a Will save (DC 10 + 1/2 the bard’s level + the bard’s Cha modifier) to negate the effect. If the save succeeds, the creature is immune to this ability for 24 hours. If the save fails, the target becomes frightened and flees for as long as the target can hear the bard’s performance. Frightening tune relies on audible components."]}, {"name":"versatile performance", "type":"Ex", "description":["4th"]}], {"1":5, "2":5, "3":4, "4":4, "5":2}, {"0":6, "1":6, "2":6, "3":5, "4":4, "5":3}],
				["15", "1", "1", "0", "0", [{"name":"inspire heroics", "type":"Su", "description":["A bard of 15th level or higher can inspire tremendous heroism in himself or a single ally within 30 feet. For every three bard levels the character attains beyond 15th, he can inspire heroics in one additional creature. To inspire heroics, all of the targets must be able to see and hear the bard. Inspired creatures gain a +4 morale bonus on saving throws and a +4 dodge bonus to AC. The effect lasts for as long as the targets are able to witness the performance. Inspire heroics is a mind-affecting ability that relies on audible and visual components."]}], {"1":5, "2":5, "3":5, "4":4, "5":3}, {"0":6, "1":6, "2":6, "3":5, "4":4, "5":4}],
				["16", "1", "0", "1", "1", [{"name":"jack of all trades", "type":"Ex", "description":["At 16th level, the bard considers all skills to be class skills."]}], {"1":5, "2":5, "3":5, "4":4, "5":3, "6":1}, {"0":6, "1":6, "2":6, "3":5, "4":5, "5":4, "6":2}],
				["17", "0", "0", "0", "0", [], {"1":5, "2":5, "3":5, "4":4, "5":4, "6":2}, {"0":6, "1":6, "2":6, "3":6, "4":5, "5":4, "6":3}],
				["18", "1", "1", "1", "1", [{"name":"mass suggestion", "type":"Sp", "description":["This ability functions just like suggestion, but allows a bard of 18th level or higher to make a suggestion simultaneously to any number of creatures that he has already fascinated. Mass suggestion is an enchantment (compulsion), mind-affecting, language dependent ability that relies on audible components."]}, {"name":"versatile performance", "type":"Ex", "description":["5th"]}], {"1":5, "2":5, "3":5, "4":5, "5":4, "6":3}, {"0":6, "1":6, "2":6, "3":6, "4":5, "5":4, "6":4}],
				["19", "1", "0", "0", "0", [{"name":"jack of all trades", "type":"Ex", "description":["At 19th level, the bard can take 10 on any skill check, even if it is not normally allowed."]}], {"1":5, "2":5, "3":5, "4":5, "5":5, "6":4}, {"0":6, "1":6, "2":6, "3":6, "4":5, "5":5, "6":4}],
				["20", "1", "0", "1", "1", [{"name":"deadly performance", "type":"Su", "description":["A bard of 20th level or higher can use his performance to cause one enemy to die from joy or sorrow. To be affected, the target must be able to see and hear the bard perform for 1 full round and be within 30 feet. The target receives a Will save (DC 10 + 1/2 the bard’s level + the bard’s Cha modifier) to negate the effect. If a creature’s saving throw succeeds, the target is staggered for 1d4 rounds, and the bard cannot use deadly performance on that creature again for 24 hours. If a creature’s saving throw fails, it dies. Deadly performance is a mind-effecting death effect that relies on audible and visual components."]}], {"1":5, "2":5, "3":5, "4":5, "5":5, "6":5}, {"0":6, "1":6, "2":6, "3":6, "4":6, "5":5, "6":5}]
			]
		}
	},
 	{
		"id":4,
		"thum":"img",
		"name": "rogue",
		"expand":false,
		"classFeatures":{
			"blurb":"This and that about Rogues excel at moving about unseen and catching foes unaware, and tend to avoid head-to-head combat. Their varied skills and abilities allow them to be highly versatile, with great variations in expertise existing between different rogues. Most, however, excel in overcoming hindrances of all types, from unlocking doors and disarming traps to outwitting magical hazards and conning dull-witted opponents.",
			"alignment":"any",
			"hd": 8,
			"wealth":{
				"number":4,
				"type":6
			},
			"skills":8,
			"classSkills":[
				"acrobatics",
				"appraise",
				"bluff",
				"climb",
				"craft",
				"diplomacy",
				"disableDevice",
				"disguise",
				"escapeArtist",
				"intimidate",
				"knowledge (dungeoneering)",
				"knowledge (local)",
				"linguistics",
				"perception",
				"perform",
				"profession",
				"senseMotive",
				"sleightOfHand",
				"stealth",
				"swim",
				"useMagicDevice"
			],
			"bab":"3/5",
			"goodSaves":["reflex"],
			"proficiency":[ "simple weapons", "hand crossbow", "rapier", "sap", "shortbow", "shortsword", "light armor" ],
			"table":[
				["level", "bab", "fort", "ref", "will", "special", "spells"],
				["1", "0", "0", "2", "0", [{"name":"sneak attack", "type":"Ex", "description":["If a rogue can catch an opponent when he is unable to defend himself effectively from her attack, she can strike a vital spot for extra damage. The rogue’s attack deals extra damage anytime her target would be denied a Dexterity bonus to AC (whether the target actually has a Dexterity bonus or not), or when the rogue flanks her target. This extra damage is 1d6 at 1st level, and increases by 1d6 every two rogue levels thereafter. Should the rogue score a critical hit with a sneak attack, this extra damage is not multiplied. Ranged attacks can count as sneak attacks only if the target is within 30 feet.", "With a weapon that deals nonlethal damage (like a sap, whip, or an unarmed strike), a rogue can make a sneak attack that deals nonlethal damage instead of lethal damage. She cannot use a weapon that deals lethal damage to deal nonlethal damage in a sneak attack, not even with the usual –4 penalty.", "The rogue must be able to see the target well enough to pick out a vital spot and must be able to reach such a spot. A rogue cannot sneak attack while striking a creature with concealment."]}, {"name":"trapfinding", "type":"Ex", "description":["A rogue adds 1/2 her level to Perception skill checks made to locate traps and to Disable Device skill checks (minimum +1). A rogue can use Disable Device to disarm magic traps."]}]],
				["2", "1", "0", "1", "0", [{"name":"evasion", "type":"Ex", "description":["At 2nd level and higher, a rogue can avoid even magical and unusual attacks with great agility. If she makes a successful Reflex saving throw against an attack that normally deals half damage on a successful save, she instead takes no damage. Evasion can be used only if the rogue is wearing light armor or no armor. A helpless rogue does not gain the benefit of evasion."]}, {"name":"rogue talent", "type":"Ex", "description":["As a rogue gains experience, she learns a number of talents that aid her and confound her foes. Starting at 2nd level, a rogue gains one rogue talent. She gains an additional rogue talent for every 2 levels of rogue attained after 2nd level. A rogue cannot select an individual talent more than once.", "Talents marked with an asterisk add effects to a rogue’s sneak attack. Only one of these talents can be applied to an individual attack and the decision must be made before the attack roll is made. ", "A rogue cannot choose a ninja trick with the same name as a rogue talent."]}]],
				["3", "1", "1", "0", "1", [{"name":"sneak attack", "type":"Ex", "description":["2nd"]}, {"name":"trap sense", "type":"Ex", "description":["At 3rd level, a rogue gains an intuitive sense that alerts her to danger from traps, giving her a +1 bonus on Reflex saves made to avoid traps and a +1 dodge bonus to AC against attacks made by traps. These bonuses rise to +2 when the rogue reaches 6th level, to +3 when she reaches 9th level, to +4 when she reaches 12th level, to +5 at 15th, and to +6 at 18th level. Trap sense bonuses gained from multiple classes stack."]}]],
				["4", "1", "0", "1", "0", [{"name":"rogue talent", "type":"Ex", "description":["2nd"]}, {"name":"uncanny dodge", "type":"Ex", "description":["Starting at 4th level, a rogue can react to danger before her senses would normally allow her to do so. She cannot be caught flat-footed, nor does she lose her Dex bonus to AC if the attacker is invisible. She still loses her Dexterity bonus to AC if immobilized. A rogue with this ability can still lose her Dexterity bonus to AC if an opponent successfully uses the feint action (see Combat) against her.", "If a rogue already has uncanny dodge from a different class, she automatically gains improved uncanny dodge (see below) instead."]}]],
				["5", "0", "0", "0", "0", [{"name":"sneak attack", "type":"Ex", "description":["3rd"]}]],
				["6", "1", "1", "1", "1", [{"name":"rogue talent", "type":"Ex", "description":["3rd"]}, {"name":"trap sense", "type":"Ex", "description":["2nd"]}]],
				["7", "1", "0", "0", "0", [{"name":"sneak attack", "type":"Ex", "description":["4th"]}]],
				["8", "1", "0", "1", "0", [{"name":"improved uncanny dodge", "type":"Ex", "description":["A rogue of 8th level or higher can no longer be flanked. This defense denies another rogue the ability to sneak attack the character by flanking her, unless the attacker has at least four more rogue levels than the target does. If a character already has uncanny dodge (see above) from another class, the levels from the classes that grant uncanny dodge stack to determine the minimum rogue level required to flank the character."]}, {"name":"rogue talent", "type":"Ex", "description":["4th"]}]],
				["9", "0", "1", "0", "1", [{"name":"sneak attack", "type":"Ex", "description":["5th"]}, {"name":"trap sense", "type":"Ex", "description":["3rd"]}]],
				["10", "1", "0", "1", "0", [{"name":"advanced talents", "type":"Ex", "description":["At 10th level, and every two levels thereafter, a rogue can choose an advanced talents in place of a rogue talent."]}, {"name":"rogue talent", "type":"Ex", "description":["5th"]}]],
				["11", "1", "0", "0", "0", [{"name":"sneak attack", "type":"Ex", "description":["6th"]}]],
				["12", "1", "1", "1", "1", [{"name":"rogue talent", "type":"Ex", "description":["6th"]}, {"name":"trap sense", "type":"Ex", "description":["4th"]}]],
				["13", "0", "0", "0", "0", [{"name":"sneak attack", "type":"Ex", "description":["7th"]}]],
				["14", "1", "0", "1", "0", [{"name":"rogue talent", "type":"Ex", "description":["7th"]}]],
				["15", "1", "1", "0", "1", [{"name":"sneak attack", "type":"Ex", "description":["8th"]}, {"name":"trap sense", "type":"Ex", "description":["5th"]}]],
				["16", "1", "0", "1", "0", [{"name":"rogue talent", "type":"Ex", "description":["8th"]}]],
				["17", "0", "0", "0", "0", [{"name":"sneak attack", "type":"Ex", "description":["9th"]}]],
				["18", "1", "1", "1", "1", [{"name":"rogue talent", "type":"Ex", "description":["9th"]}, {"name":"trap sense", "type":"Ex", "description":["6th"]}]],
				["19", "1", "0", "0", "0", [{"name":"sneak attack", "type":"Ex", "description":["10th"]}]],
				["20", "1", "0", "1", "0", [{"name":"master strike", "type":"Ex", "description":["Upon reaching 20th level, a rogue becomes incredibly deadly when dealing sneak attack damage. Each time the rogue deals sneak attack damage, she can choose one of the following three effects: put to sleep for 1d4 hours, paralyzed for 2d6 rounds, or slain.", "Regardless of the effect chosen, the target receives a Fortitude save to negate the additional effect. The DC of this save is equal to 10 + 1/2 the rogue’s level + the rogue’s Intelligence modifier. Once a creature has been the target of a master strike, regardless of whether or not the save is made, that creature is immune to that rogue’s master strike for 24 hours. Creatures that are immune to sneak attack damage are also immune to this ability."]}, {"name":"rogue talent", "type":"Ex", "description":["10th"]}]]
			]
		}
	},
 	{
		"id":5,
		"thum":"img",
		"name": "sorcerer",
		"expand":false,
		"classFeatures":{
			"blurb":"Sorcerers excel at casting a selection of favored spells frequently, making them powerful battle mages. As they become familiar with a specific and ever-widening set of spells, sorcerers often discover new and versatile ways of making use of magics other spellcasters might overlook. Their bloodlines also grant them additional abilities, assuring that no two sorcerers are ever quite alike.",
			"alignment":"any",
			"hd": 6,
			"wealth":{
				"number":2,
				"type":6
			},
			"skills":2,
			"classSkills":[
				"appraise",
				"bluff",
				"craft",
				"fly",
				"intimidate",
				"knowledge (arcana)",
				"profession",
				"spellcraft",
				"useMagicDevice"
			],
			"bab":"1/2",
			"goodSaves":["will"],
			"proficiency":[ "simple weapons" ],
			"table":[
				["level", "bab", "fort", "ref", "will", "special", "spells"],
				["1", "0", "0", "0", "2", [{"name":"eschew materials", "description":["A sorcerer gains Eschew Materials as a bonus feat at 1st level."]}, {"name":"cantrips", "description":["Sorcerers learn a number of cantrips, or 0-level spells. These spells are cast like any other spell, but they do not consume any slots and may be used again."]},{"name":"bloodline", "description":["Each sorcerer has a source of magic somewhere in her heritage that grants her spells, bonus feats, an additional class skill, and other special abilities. This source can represent a blood relation or an extreme event involving a creature somewhere in the family’s past. For example, a sorcerer might have a dragon as a distant relative or her grandfather might have signed a terrible contract with a devil. Regardless of the source, this influence manifests in a number of ways as the sorcerer gains levels. A sorcerer must pick one bloodline upon taking her first level of sorcerer. Once made, this choice cannot be changed."]},{"name":"bloodline power", "description":["Filled with magical power that screams for release, sorcery is not so much a calling as a blessing—or a curse. For some sorcerers, this arcane birthright manifests in subtle and carefully controlled ways, assisting in their manipulation of others or the pursuit of lofty goals. For others, it is wild and unpredictable, the primal and explosive lashing out of a power greater than themselves."]}], {"1":3}, {"0":4, "1":2}],
				["2", "1", "0", "0", "1", [], {"1":4}, {"0":5, "1":2}],
				["3", "0", "1", "1", "0", [{"name":"bloodline power", "description":["2nd"]},{"name":"bloodline spell", "description":["At 3rd level, and every two levels thereafter, a sorcerer learns an additional spell, derived from her bloodline. These spells are in addition to the number of spells normally known. These spells cannot be exchanged for different spells at higher levels."]}], {"1":5}, {"0":5, "1":3}],
				["4", "1", "0", "0", "1", [], {"1":6, "2":3}, {"0":6, "1":3, "2":1}],
				["5", "0", "0", "0", "0", [{"name":"bloodline spell", "description":["2nd"]}], {"1":6, "2":4}, {"0":6, "1":4, "2":2}],
				["6", "1", "1", "1", "1", [], {"1":6, "2":5, "3":3}, {"0":7, "1":4, "2":2, "3":1}],
				["7", "0", "0", "0", "0", [{"name":"bloodline feat", "description":["At 7th level, and every six levels thereafter, a sorcerer receives one bonus feat, chosen from a list specific to each bloodline. The sorcerer must meet the prerequisites for these bonus feats."]},{"name":"bloodline spell", "description":["3rd"]}], {"1":6, "2":6, "3":4}, {"0":7, "1":5, "2":3, "3":2}],
				["8", "1", "0", "0", "1", [], {"1":6, "2":6, "3":5, "4":3}, {"0":8, "1":5, "2":3, "3":2, "4":1}],
				["9", "0", "1", "1", "0", [{"name":"bloodline power", "description":["3rd"]},{"name":"bloodline spell", "description":["4th"]}], {"1":6, "2":6, "3":6, "4":4}, {"0":8, "1":5, "2":4, "3":3, "4":2}],
				["10", "1", "0", "0", "1", [], {"1":6, "2":6, "3":6, "4":5, "5":3}, {"0":9, "1":5, "2":4, "3":3, "4":2, "5":1}],
				["11", "0", "0", "0", "0", [{"name":"bloodline spell", "description":["5th"]}], {"1":6, "2":6, "3":6, "4":6, "5":4}, {"0":9, "1":5, "2":5, "3":4, "4":3, "5":2}],
				["12", "1", "1", "1", "1", [], {"1":6, "2":6, "3":6, "4":6, "5":5, "6":3}, {"0":9, "1":5, "2":5, "3":4, "4":3, "5":2, "6":1}],
				["13", "0", "0", "0", "0", [{"name":"bloodline feat", "description":["2nd"]},{"name":"bloodline spell", "description":["6th"]}], {"1":6, "2":6, "3":6, "4":6, "5":6, "6":4}, {"0":9, "1":5, "2":5, "3":4, "4":4, "5":3, "6":2}],
				["14", "1", "0", "0", "1", [], {"1":6, "2":6, "3":6, "4":6, "5":6, "6":5, "7":3}, {"0":9, "1":5, "2":5, "3":4, "4":4, "5":3, "6":2, "7":1}],
				["15", "0", "1", "1", "0", [{"name":"bloodline power", "description":["4th"]},{"name":"bloodline spell", "description":["7th"]}], {"1":6, "2":6, "3":6, "4":6, "5":6, "6":6, "7":4}, {"0":9, "1":5, "2":5, "3":4, "4":4, "5":4, "6":3, "7":2}],
				["16", "1", "0", "0", "1", [], {"1":6, "2":6, "3":6, "4":6, "5":6, "6":6, "7":5, "8":3}, {"0":9, "1":5, "2":5, "3":4, "4":4, "5":4, "6":3, "7":2, "8":1}],
				["17", "0", "0", "0", "0", [{"name":"bloodline spell", "description":["8th"]}], {"1":6, "2":6, "3":6, "4":6, "5":6, "6":6, "7":6, "8":4}, {"0":9, "1":5, "2":5, "3":4, "4":4, "5":4, "6":3, "7":3, "8":2}],
				["18", "1", "1", "1", "1", [], {"1":6, "2":6, "3":6, "4":6, "5":6, "6":6, "7":6, "8":5, "9":3}, {"0":9, "1":5, "2":5, "3":4, "4":4, "5":4, "6":3, "7":3, "8":2, "9":1}],
				["19", "0", "0", "0", "0", [{"name":"bloodline feat", "description":["3rd"]},{"name":"bloodline spell", "description":["9th"]}], {"1":6, "2":6, "3":6, "4":6, "5":6, "6":6, "7":6, "8":6, "9":4}, {"0":9, "1":5, "2":5, "3":4, "4":4, "5":4, "6":3, "7":3, "8":3, "9":2}],
				["20", "1", "0", "0", "1", [{"name":"bloodline power", "description":["5th"]}], {"1":6, "2":6, "3":6, "4":6, "5":6, "6":6, "7":6, "8":6, "9":6}, {"0":9, "1":5, "2":5, "3":4, "4":4, "5":4, "6":3, "7":3, "8":3, "9":3}]
			]
		}
	},
 	{
		"id":6,
		"thum":"img",
		"name": "druid",
		"expand":false,
		"classFeatures":{
			"blurb":"While some druids might keep to the fringe of battle, allowing companions and summoned creatures to fight while they confound foes with the powers of nature, others transform into deadly beasts and savagely wade into combat. Druids worship personifications of elemental forces, natural powers, or nature itself. Typically this means devotion to a nature deity, though druids are just as likely to revere vague spirits, animalistic demigods, or even specific awe-inspiring natural wonders.",
			"alignment":"neutral",
			"hd": 8,
			"wealth":{
				"number":2,
				"type":6
			},
			"skills":4,
			"classSkills":[
				"climb",
				"craft",
				"fly",
				"handleAnimal",
				"heal",
				"knowledge (geography)",
				"knowledge (nature)",
				"perception",
				"profession",
				"ride",
				"spellcraft",
				"survival",
				"swim"
			],
			"bab":"3/4",
			"goodSaves":["fortitude", "will"],
			"proficiency":[ "club", "dagger", "dart", "quarterstaff", "scimitar", "scythe", "sickle", "shortspear", "sling", "spear", "light armor", "medium armor", "shields" ],
			"table":[
				["level", "bab", "fort", "ref", "will", "special", "spells"],
				["1", "0", "2", "0", "2", [{"name":"bonus languages", "description":["A druid’s bonus language options include Sylvan, the language of woodland creatures. This choice is in addition to the bonus languages available to the character because of her race.", "A druid also knows Druidic, a secret language known only to druids, which she learns upon becoming a 1st-level druid. Druidic is a free language for a druid; that is, she knows it in addition to her regular allotment of languages and it doesn’t take up a language slot. Druids are forbidden to teach this language to nondruids. Druidic has its own alphabet."]}, {"name":"nature sense", "type":"Ex", "description":["A druid gains a +2 bonus on Knowledge (nature) and Survival checks."]}, {"name":"wild empathy", "type":"Ex", "description":["A druid can improve the attitude of an animal. This ability functions just like a Diplomacy check made to improve the attitude of a person. The druid rolls 1d20 and adds her druid level and her Charisma modifier to determine the wild empathy check result. The typical domestic animal has a starting attitude of indifferent, while wild animals are usually unfriendly.", "To use wild empathy, the druid and the animal must be able to study each other, which means that they must be within 30 feet of one another under normal conditions. Generally, influencing an animal in this way takes 1 minute but, as with influencing people, it might take more or less time.", "A druid can also use this ability to influence a magical beast with an Intelligence score of 1 or 2, but she takes a –4 penalty on the check."]}, {"name":"nature bond", "type":"Ex", "description":["At 1st level, a druid forms a bond with nature. This bond can take one of two forms. The first is a close tie to the natural world, granting the druid one of the following cleric domains: Air, Animal, Earth, Fire, Plant, Water, or Weather. Druids also have access to a set of Animal and Terrain Domains. When determining the powers and bonus spells granted by this domain, the druid’s effective cleric level is equal to her druid level. A druid that selects this option also receives additional domain spell slots, just like a cleric. She must prepare the spell from her domain in this slot and this spell cannot be used to cast a spell spontaneously.", "The second option is to form a close bond with an animal companion. A druid may begin play with any of the animals listed in Animal Choices. This animal is a loyal companion that accompanies the druid on her adventures. Unlike normal animals of its kind, an animal companion’s Hit Dice, abilities, skills, and feats advance as the druid advances in level. If a character receives an animal companion from more than one source, her effective druid levels stack for the purposes of determining the statistics and abilities of the companion. Most animal companions increase in size when their druid reaches 4th or 7th level, depending on the companion. If a druid releases her companion from service, she may gain a new one by performing a ceremony requiring 24 uninterrupted hours of prayer in the environment where the new companion typically lives. This ceremony can also replace an animal companion that has perished."]}, {"name":"orisons", "type":"Sp", "description":["Druids can prepare a number of orisons, or 0-level spells, each day. These spells are cast like any other spell, but they are not expended when cast and may be used again."]}, {"name":"spontaneous casting", "description":["A druid can channel stored spell energy into summoning spells that she hasn’t prepared ahead of time. She can “lose” a prepared spell in order to cast any summon nature’s ally spell of the same level or lower."]}, {"name":"spells", "description":["A druid casts divine spells, which are drawn from the druid spell list. Her alignment may restrict her from casting certain spells opposed to her moral or ethical beliefs; A druid can’t cast spells of an alignment opposed to her own or her deity’s (if she has one). Spells associated with particular alignments are indicated by the chaos, evil, good, and law descriptors in their spell descriptions. A druid must choose and prepare her spells in advance. To prepare or cast a spell, the druid must have a Wisdom score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a druid’s spell is 10 + the spell level + the druid’s Wisdom modifier.", "Like other spellcasters, a druid can cast only a certain number of spells of each spell level per day. Her base daily spell allotment is given on Table: Druid. In addition, she receives bonus spells per day if she has a high Wisdom score.", "A druid must spend 1 hour each day in a trance-like meditation on the mysteries of nature to regain her daily allotment of spells. A druid may prepare and cast any spell on the druid spell list, provided that she can cast spells of that level, but she must choose which spells to prepare during her daily meditation."]}], {"0":3, "1":1}],
				["2", "1", "1", "0", "1", [{"name":"woodland stride", "type":"Ex", "description":["Starting at 2nd level, a druid may move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at her normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that have been magically manipulated to impede motion, however, still affect her."]}], {"0":4, "1":2}],
				["3", "1", "0", "1", "0", [{"name":"trackless step", "type":"Ex", "description":["Starting at 3rd level, a druid leaves no trail in natural surroundings and cannot be tracked. She may choose to leave a trail if so desired."]}], {"0":4, "1":2, "2":1}],
				["4", "1", "1", "0", "1", [{"name":"resist nature's lure", "type":"Ex", "description":["Starting at 4th level, a druid gains a +4 bonus on saving throws against the spell-like and supernatural abilities of fey. This bonus also applies to spells and effects that target plants, such as blight, entangle, spike growth, and warp wood."]}, {"name":"wild shape", "type":"Su", "description":["At 4th level, a druid gains the ability to turn herself into any small or Medium animal and back again once per day. Her options for new forms include all creatures with the animal type. This ability functions like the beast shape I spell, except as noted here. The effect lasts for 1 hour per druid level, or until she changes back. Changing form (to animal or back) is a standard action and doesn’t provoke an attack of opportunity. The form chosen must be that of an animal the druid is familiar with.", "A druid loses her ability to speak while in animal form because she is limited to the sounds that a normal, untrained animal can make, but she can communicate normally with other animals of the same general grouping as her new form. (The normal sound a wild parrot makes is a squawk, so changing to this form does not permit speech.)", "A druid can use this ability an additional time per day at 6th level and every two levels thereafter, for a total of eight times at 18th level. At 20th level, a druid can use wild shape at will. As a druid gains in levels, this ability allows the druid to take on the form of larger and smaller animals, elementals, and plants. Each form expends one daily usage of this ability, regardless of the form taken."]}], {"0":4, "1":3, "2":2}],
				["5", "0", "0", "0", "0", [], {"0":4, "1":3, "2":2, "3":1}],
				["6", "1", "1", "1", "1", [{"name":"wild shape", "type":"Su", "description":["At 6th level, a druid can use wild shape to change into a Large or Tiny animal or a Small elemental. When taking the form of an animal, a druid’s wild shape now functions as beast shape II. When taking the form of an elemental, the druid’s wild shape functions as elemental body I."]}], {"0":4, "1":3, "2":3, "3":2}],
				["7", "1", "0", "0", "0", [], {"0":4, "1":4, "2":3, "3":2, "4":1}],
				["8", "1", "1", "0", "1", [{"name":"wild shape", "type":"Su", "description":["At 8th level, a druid can use wild shape to change into a Huge or Diminutive animal, a Medium elemental, or a Small or Medium plant creature. When taking the form of animals, a druid’s wild shape now functions as beast shape III. When taking the form of an elemental, the druid’s wild shape now functions as elemental body II. When taking the form of a plant creature, the druid’s wild shape functions as plant shape I."]}], {"0":4, "1":4, "2":3, "3":3, "4":2}],
				["9", "0", "0", "1", "0", [{"name":"venum immunity", "type":"Ex", "description":["At 9th level, a druid gains immunity to all poisons."]}], {"0":4, "1":4, "2":4, "3":3, "4":2, "5":1}],
				["10", "1", "1", "0", "1", [{"name":"wild shape", "type":"Su", "description":["At 10th level, a druid can use wild shape to change into a Large elemental or a Large plant creature. When taking the form of an elemental, the druid’s wild shape now functions as elemental body III. When taking the form of a plant, the druid’s wild shape now functions as plant shape II."]}], {"0":4, "1":4, "2":4, "3":3, "4":3, "5":2}],
				["11", "1", "0", "0", "0", [], {"0":4, "1":4, "2":4, "3":4, "4":3, "5":2, "6":1}],
				["12", "1", "1", "1", "1", [{"name":"wild shape", "type":"Su", "description":["At 12th level, a druid can use wild shape to change into a Huge elemental or a Huge plant creature. When taking the form of an elemental, the druid’s wild shape now functions as elemental body IV. When taking the form of a plant, the druid’s wild shape now functions as plant shape III."]}], {"0":4, "1":4, "2":4, "3":4, "4":3, "5":3, "6":2}],
				["13", "0", "0", "0", "0", [{"name":"a thousand faces", "type":"Su", "description":["At 13th level, a druid gains the ability to change her appearance at will, as if using the alter self spell, but only while in her normal form."]}], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":3, "6":2, "7":1}],
				["14", "1", "1", "0", "1", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":3, "6":3, "7":2}],
				["15", "1", "0", "1", "0", [{"name":"timeless body", "type":"Ex", "description":["After attaining 15th level, a druid no longer takes ability score penalties for aging and cannot be magically aged. Any penalties she may have already incurred, however, remain in place. Bonuses still accrue, and the druid still dies of old age when her time is up."]}], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":3, "7":2, "8":1}],
				["16", "1", "1", "0", "1", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":3, "7":3, "8":2}],
				["17", "0", "0", "0", "0", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":4, "7":3, "8":2, "9":1}],
				["18", "1", "1", "1", "1", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":4, "7":3, "8":3, "9":2}],
				["19", "1", "0", "0", "0", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":4, "7":4, "8":3, "9":3}],
				["20", "1", "1", "0", "1", [], {"0":4, "1":4, "2":4, "3":4, "4":4, "5":4, "6":4, "7":4, "8":4, "9":4}]
			]
		}
	}
]