[
    {
        "type":"domain",
        "name":"air",
        "description":"You can manipulate lightning, mist, and wind, traffic with air creatures, and are resistant to electricity damage.",
        "grantedPowers":[
            {"name":"Lightning Arc",
            "type":"Sp",
            "level":1,
            "description":"As a standard action, you can unleash an arc of electricity targeting any foe within 30 feet as a ranged touch attack. This arc of electricity deals 1d6 points of electricity damage + 1 point for every two cleric levels you possess. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."
            },
            {"name":"Electricity Resistance",
                "type":"Ex",
                "level":6,
                "description":"At 6th level, you gain resist electricity 10. This resistance increases to 20 at 12th level. At 20th level, you gain immunity to electricity."
            }
        ],
        "domainSpells":[{"1st":"obscuring mist"},{"2nd":"wind wall"},{"3rd":"gaseous form"},
            {"4th":"air walk"},{"5th":"control winds"},{"6th":"chain lightning"},
            {"7th":"elemental body IV","limitation":"air"},{"8th":"whirlwind"},{"9th":"elemental swarm","limitation":"air"}],
        "subdomains":["cloud", "lightning", "wind"]
    },{
        "type":"domain",
        "name":"earth",
        "description":"You have mastery over earth, metal, and stone, can fire darts of acid, and command earth creatures.",
        "grantedPowers":[
            {"name":"Acid Dart",
            "type":"Sp",
            "level":1,
            "description":"As a standard action, you can unleash an acid dart targeting any foe within 30 feet as a ranged touch attack. This acid dart deals 1d6 points of acid damage + 1 point for every two cleric levels you possess. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."
            },
            {"name":"Acid Resistance",
                "type":"Ex",
                "level":6,
                "description":"At 6th level, you gain resist acid 10. This resistance increases to 20 at 12th level. At 20th level, you gain immunity to acid."
            }
        ],
        "domainSpells":[{"1st":"magic stone"},{"2nd":"soften earth and stone"},{"3rd":"stone shape"},
            {"4th":"spike stones"},{"5th":"wall of stone"},{"6th":"stoneskin"},
            {"7th":"elemental body IV","limitation":"earth"},{"8th":"earthquake"},{"9th":"elemental swarm","limitation":"earth"}],
            "subdomains":["Caves", "Petrification", "Radiation"]
    },{
        "name":"caves",
        "type":"subdomain",
        "associatedDomain": "earth",
        "replacementPower": {
            "replaces":"Acid Resistance",
            "name":"Tunnel Runner",
            "type": "Su",
            "level": 8,
            "description": ["you can move through tunnels and caves with ease. Activating this ability is a standard action. You can move across any stone surface as if under the effects of spider climb. You can also see very well in darkness, gaining darkvision out to a range of 60 feet. If you already possess darkvision, extend the range by 60 feet. While underground, you also gain an insight bonus equal to your cleric level on Stealth skill checks and an insight bonus equal to your Wisdom modifier on initiative checks. You can use this ability for 1 minute per day per cleric level you possess. These minutes do not need to be consecutive, but they must be spent in 1-minute increments."]
        },
        "replacementDomainSpells":[{"2nd":"create pit"},{"3rd":"spiked pit"},{"6th":"hungry pit"}]
    },{
        "name":"petrification",
        "type":"subdomain",
        "associatedDomain": "earth",
        "replacementPower": {
            "replaces":"Acid Dart",
            "name":"Fossil Form",
            "type": "Su",
            "level": 1,
            "description": ["At the beginning of your turn as a swift action, you can infuse your flesh with minerals, granting you cumbersome security. Until the beginning of your next turn, you are staggered, gain hardness 2, and gain a +2 bonus on saving throws against petrification. This hardness increases by 2 and your saving throw bonus increases by 1 for every 4 cleric levels you have. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."]
        },
        "replacementDomainSpells":[{"4th":"calcific touch"},{"5th":"stoneskin"},{"6th":"flesh to stone"},{"8th":"statue"}]
    },{
        "name":"radiation",
        "type":"subdomain",
        "associatedDomain": "earth",
        "replacementPower": {
            "replaces":"Acid Dart",
            "name":"Radiating Touch",
            "type": "Su",
            "level": 1,
            "description": ["As a standard action that provokes attacks of opportunity, you can irradiate any unattended object for a number of rounds equal to your cleric level. While an object is irradiated, it emits a faint aura of transmutation.","Any creature that passes within 5 feet of the aura must succeed at a Will save (DC equal to 10 + 1/2 your cleric level + your Wisdom modifier) or become sickened. You’re immune to this object’s effect. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."]
        },
        "replacementDomainSpells":[{"2nd":"defoliate"},{"4th":"blight"},{"8th":"horrid wilting"}]
    },{
        "name":"wind",
        "type":"subdomain",
        "associatedDomain": "air",
        "replacementPower": {
            "replaces":"Lightning Arc",
            "name":"Wind Blast",
            "type": "Su",
            "level": 1,
            "description": ["As a standard action, you can unleash a blast of air in a 30-foot line. Make a combat maneuver check against each creature in the line, using your caster level as your base attack bonus and your Wisdom modifier in place of your Strength modifier. Treat the results as a bull rush attempt. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."]
        },
        "replacementDomainSpells":[{"1st":"whispering wind"},{"6th":"wind walk"},{"9th":"winds of vengeance"}]
    },{
        "name":"cloud",
        "type":"subdomain",
        "associatedDomain": "air",
        "replacementPower": {
            "replaces":"Electricity Resistance",
            "name":"Thundercloud",
            "type": "Su",
            "level": 8,
            "description": ["you can, as a standard action, summon a storm cloud. This power functions as fog cloud except that creatures inside the cloud are deafened and take 2d6 points of electricity damage each round from the flashes of thunder and lightning. Once created, you can concentrate on the cloud to move it up to 30 feet each round. You can use this ability for a number of rounds per day equal to your cleric level. These rounds do not need to be consecutive."]
        },
        "replacementDomainSpells":[{"4th":"solid fog"},{"9th":"storm of vengeance"}]
    },{
        "name":"lightning",
        "type":"subdomain",
        "associatedDomain": "air",
        "replacementPower": {
            "replaces":"Electricity Resistance",
            "name":"Lightning Rod",
            "type": "Su",
            "level": 1,
            "description": ["As a swift action when you cast a spell with the electricity descriptor, you can designate one creature within line of sight. The spell’s damage against that creature increases by 50%, as if affected by the Empower Spell feat. This additional damage results from divine power that is not subject to being reduced by electricity resistance, and you take an equal amount of electricity damage immediately after you cast the spell.","The spell can deal this additional damage only once, even if it could affect the target multiple times. You can use this ability once per day at 8th level and one additional time per day for every 4 cleric levels you have beyond 8th."]
        },
        "replacementDomainSpells":[{"1st":"shocking grasp"},{"2nd":"flame blade","limitation":"electricity"},{"3rd":"lightning bolt"}]
    },{
        "type":"domain",
        "name":"fire",
        "description":"You can call forth fire, command creatures of the inferno, and your flesh does not burn.",
        "grantedPowers":[
            {"name":"Fire Bolt",
            "type":"Sp",
            "level":1,
            "description":"As a standard action, you can unleash a scorching bolt of divine fire from your outstretched hand. You can target any single foe within 30 feet as a ranged touch attack with this bolt of fire. If you hit the foe, the fire bolt deals 1d6 points of fire damage + 1 point for every two cleric levels you possess. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."
            },
            {"name":"Fire Resistance",
                "type":"Ex",
                "level":6,
                "description":"At 6th level, you gain resist fire 10. This resistance increases to 20 at 12th level. At 20th level, you gain immunity to fire."
            }
        ],
        "domainSpells":[{"1st":"burning hands"},{"2nd":"produce flame"},{"3rd":"fireball"},
            {"4th":"wall of fire"},{"5th":"fire shield"},{"6th":"fire seeds"},
            {"7th":"elemental body IV","limitation":"fire"},{"8th":"incendiary cloud"},{"9th":"elemental swarm","limitation":"fire"}],
        "subdomains":["arson", "ash", "smoke"]
    },{
        "type":"domain",
        "name":"glory",
        "description":"You are infused with the glory of the divine, and are a true foe of the undead. In addition, when you channel positive energy to harm undead creatures, the save DC to halve the damage is increased by 2.",
        "grantedPowers":[
            {"name":"Touch of Glory",
            "type":"Sp",
            "level":1,
            "description":"You can cause your hand to shimmer with divine radiance, allowing you to touch a creature as a standard action and give it a bonus equal to your cleric level on a single Charisma-based skill check or Charisma ability check. This ability lasts for 1 hour or until the creature touched elects to apply the bonus to a roll. You can use this ability to grant the bonus a number of times per day equal to 3 + your Wisdom modifier."
            },
            {"name":"Divine Presence",
                "type":"Su",
                "level":8,
                "description":"At 8th level, you can emit a 30-foot aura of divine presence for a number of rounds per day equal to your cleric level. All allies within this aura are treated as if under the effects of a sanctuary spell with a DC equal to 10 + 1/2 your cleric level + your Wisdom modifier. These rounds do not need to be consecutive. Activating this ability is a standard action. If an ally leaves the area or makes an attack, the effect ends for that ally. If you make an attack, the effect ends for you and your allies."
            }
        ],
        "domainSpells":[{"1st":"shield of faith"},{"2nd":"bless weapon"},{"3rd":"searing light"},
            {"4th":"holy smite"},{"5th":"righteous might"},{"6th":"undeath to death"},
            {"7th":"holy sword"},{"8th":"holy aura"},{"9th":"gate"}],
        "subdomains":["heroism", "honor", "hubris", "legend"]
    },{
        "type":"domain",
        "name":"good",
        "description":"You have pledged your life and soul to goodness and purity.",
        "grantedPowers":[
            {"name":"Touch of Good",
            "type":"Sp",
            "level":1,
            "description":"You can touch a creature as a standard action, granting a sacred bonus on attack rolls, skill checks, ability checks, and saving throws equal to half your cleric level (minimum 1) for 1 round. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."
            },
            {"name":"Holy Lance",
                "type":"Su",
                "level":8,
                "description":"At 8th level, you can give a weapon you touch the holy special weapon quality for a number of rounds equal to 1/2 your cleric level. You can use this ability once per day at 8th level, and an additional time per day for every four levels beyond 8th."
            }
        ],
        "domainSpells":[{"1st":"protection from evil"},{"2nd":"align weapon","limitation":"good"},{"3rd":"magic circle against evil"},
            {"4th":"holy smite"},{"5th":"dispel evil"},{"6th":"blade barrier"},
            {"7th":"holy word"},{"8th":"holy aura"},{"9th":"summon monster IX", "limitation":"good"}],
        "subdomains":["agathion", "archon", "azata", "friendship", "redemption"]
    },{
        "type":"domain",
        "name":"healing",
        "description":"Your touch staves off pain and death, and your healing magic is particularly vital and potent.",
        "grantedPowers":[
            {"name":"Rebuke Death",
            "type":"Sp",
            "level":1,
            "description":"You can touch a living creature as a standard action, healing it for 1d4 points of damage plus 1 for every two cleric levels you possess. You can only use this ability on a creature that is below 0 hit points. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."
            },
            {"name":"Healer's Blessing",
                "type":"Su",
                "level":6,
                "description":"At 6th level, all of your cure spells are treated as if they were empowered, increasing the amount of damage healed by half (+50%). This does not apply to damage dealt to undead with a cure spell. This does not stack with the Empower Spell metamagic feat."
            }
        ],
        "domainSpells":[{"1st":"cure light wounds"},{"2nd":"cure moderate wounds"},{"3rd":"cure serious wounds"},
            {"4th":"cure critical wounds"},{"5th":"breath of life"},{"6th":"heal"},
            {"7th":"regenerate"},{"8th":"cure critical wounds (mass)"},{"9th":"heal (mass)"}],
        "subdomains":["medicine", "restoration", "resurrection"]
    },{
        "type":"domain",
        "name":"sun",
        "description":"You see truth in the pure and burning light of the sun, and can call upon its blessing or wrath to work great deeds.",
        "grantedPowers":[
            {"name":"Sun's Blessing",
            "type":"Su",
            "level":1,
            "description":"Whenever you channel positive energy to harm undead creatures, add your cleric level to the damage dealt. Undead do not add their channel resistance to their saves when you channel positive energy."
            },
            {"name":"Nimbus of LIght",
                "type":"Su",
                "level":8,
                "description":"At 8th level, you can emit a 30-foot nimbus of light for a number of rounds per day equal to your cleric level. This acts as a daylight spell. In addition, undead within this radius take an amount of damage equal to your cleric level each round that they remain inside the nimbus. Spells and spell-like abilities with the darkness descriptor are automatically dispelled if brought inside this nimbus. These rounds do not need to be consecutive."
            }
        ],
        "domainSpells":[{"1st":"endure elements"},{"2nd":"heat metal"},{"3rd":"searing light"},
            {"4th":"fire shield"},{"5th":"flame strike"},{"6th":"fire seeds"},
            {"7th":"sunbeam"},{"8th":"sunburst"},{"9th":"prismatic sphere"}],
        "subdomains":["day", "light", "revelation", "thirst"]
    },{
        "type":"domain",
        "name":"chaos",
        "description":"Your touch infuses life and weapons with chaos, and you revel in all things anarchic.",
        "grantedPowers":[
            {"name":"Touch of Chaos",
            "type":"Sp",
            "level":1,
            "description":"You can imbue a target with chaos as a melee touch attack. For the next round, anytime the target rolls a d20, he must roll twice and take the less favorable result. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."
            },
            {"name":"Chaos Blade",
                "type":"Su",
                "level":8,
                "description":"At 8th level, you can give a weapon touched the anarchic special weapon quality for a number of rounds equal to 1/2 your cleric level. You can use this ability once per day at 8th level, and an additional time per day for every four levels beyond 8th."
            }
        ],
        "domainSpells":[{"1st":"protection from law"},{"2nd":"align weapon", "limitation":"chaos"},{"3rd":"magic circle against law"},
            {"4th":"chaos hammer"},{"5th":"dispel law"},{"6th":"animate objects"},
            {"7th":"word of chaos"},{"8th":"cloak of chaos"},{"9th":"summon monster IX", "limitation":"chaos"}],
        "subdomains":["azata", "demondand", "demon", "entropy", "protean", "revelry", "riot", "whimsy"]
    },{
        "type":"domain",
        "name":"liberation",
        "description":"You are a spirit of freedom and a staunch foe against all who would enslave and oppress.",
        "grantedPowers":[
            {"name":"Liberation",
            "type":"Su",
            "level":1,
            "description":"You have the ability to ignore impediments to your mobility. For a number of rounds per day equal to your cleric level, you can move normally regardless of magical effects that impede movement, as if you were affected by freedom of movement. This effect occurs automatically as soon as it applies. These rounds do not need to be consecutive."
            },
            {"name":"Freedom's Call",
                "type":"Su",
                "level":8,
                "description":"At 8th level, you can emit a 30-foot aura of freedom for a number of rounds per day equal to your cleric level. Allies within this aura are not affected by the confused, grappled, frightened, panicked, paralyzed, pinned, or shaken conditions. This aura only suppresses these effects, and they return once a creature leaves the aura or when the aura ends, if applicable. These rounds do not need to be consecutive."
            }
        ],
        "domainSpells":[{"1st":"remove fear"},{"2nd":"remove paralysis"},{"3rd":"remove curse"},
            {"4th":"freedom of movement"},{"5th":"break enchantment"},{"6th":"dispel magic (greater)"},
            {"7th":"refuge"},{"8th":"mind blank"},{"9th":"freedom"}],
        "subdomains":["freedom", "revolution", "self-realization", "entropy", "protean", "revelry", "riot", "whimsy"]
    },{
        "type":"domain",
        "name":"protection",
        "description":"Your faith is your greatest source of protection, and you can use that faith to defend others. In addition, you receive a +1 resistance bonus on saving throws. This bonus increases by 1 for every 5 levels you possess.",
        "grantedPowers":[
            {"name":"Resistant Touch",
            "type":"Sp",
            "level":1,
            "description":"As a standard action, you can touch an ally to grant him your resistance bonus for 1 minute. When you use this ability, you lose your resistance bonus granted by the Protection domain for 1 minute. You can use this ability a number of times per day equal to 3 + your Wisdom modifier."
            },
            {"name":"Aura of Protection",
                "type":"Su",
                "level":8,
                "description":"At 8th level, you can emit a 30-foot aura of protection for a number of rounds per day equal to your cleric level. You and your allies within this aura gain a +1 deflection bonus to AC and resistance 5 against all elements (acid, cold, electricity, fire, and sonic). The deflection bonus increases by +1 for every four cleric levels you possess beyond 8th. At 14th level, the resistance against all elements increases to 10. These rounds do not need to be consecutive."
            }
        ],
        "domainSpells":[{"1st":"sanctuary"},{"2nd":"shield other"},{"3rd":"protection from energy"},
            {"4th":"spell immunity"},{"5th":"spell resistance"},{"6th":"antimagic field"},
            {"7th":"repulsion"},{"8th":"mind blank"},{"9th":"prismatic sphere"}],
        "subdomains":["defense", "fortifications", "purity", "solitude"]
    }
]